import matplotlib.pyplot as plt

# plot()은 선 또는 마커 그래프 그리기에 사용되는 함수이다.

# 기본 사용
# x값은 기본적으로 [0, 1, 2, 3] 이 되어서 (기본적으로는 y 리스트로 받아들임)
# 점 (0, 2), (1, 3), (2, 5), (3, 10)를 잇는 꺾은선 그래프가 나타난다.
plt.plot([2, 3, 5, 10])
plt.show()

# x, y 값 입력하기
# 점 (1, 2), (2, 3), (3, 5), (4, 10)를 잇는 꺾은선 그래프가 나타난다.
plt.plot([1, 2, 3, 4], [2, 3, 5, 10])
plt.show()

# 레이블이 있는 데이터 사용하기
# 파이썬 딕셔너리와 같이 레이블이 있는 데이터를 그래프로 나타낼 수 있다.
# 레이블을 입력해주고, data 파라미터에 딕셔너리를 지정해준다.
data_dict = {'data_x': [1, 2, 3, 4, 5], 'data_y': [2, 3, 5, 10, 8]}

plt.plot('data_x', 'data_y', data=data_dict)
plt.show()